<a href="https://colab.research.google.com/github/joykiriba/Upgrade_Strategy_MTN/blob/master/Moringa_Data_Science_Prep_W3_Independent_Project_2021_03_Joy_Kiriba_Python_Notebook.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# PYTHON PROGRAMMING

# 1.0 Overview
# Which ones were the most used city for the three days?

# Which cities were the most used during business and home hours?

# Most used city for the three days?

# 1.1 Importing The Libraries to Be Used

In [ ]:
# import panda libraries

import pandas as pd

# import numpy libraries
 
import numpy as np

# 1.2 Loading Our Datasets

# 1.3 cell_geo.csv

In [ ]:
#  we use read_csv to load our csv file cells_geo

cells = pd.read_csv('cells_geo.csv', delimiter=';')
cells.head(3)

   Unnamed: 0  VILLES      STATUS  ... AREA     CELL_ID   SITE_CODE
0           0  ADJAME  In Service  ...  NaN  fbb2e75af3  0bb492ef17
1           1  ADJAME  In Service  ...  NaN  1502501d78  0bb492ef17
2           2  ADJAME  In Service  ...  NaN  0c2e182a0c  0bb492ef17

[3 rows x 12 columns]

In [ ]:
# Drop unnamed column
cells.drop('Unnamed: 0', axis=1, inplace=True)
cells.head(3)

   VILLES      STATUS LOCALISATION  ... AREA     CELL_ID   SITE_CODE
0  ADJAME  In Service      ABIDJAN  ...  NaN  fbb2e75af3  0bb492ef17
1  ADJAME  In Service      ABIDJAN  ...  NaN  1502501d78  0bb492ef17
2  ADJAME  In Service      ABIDJAN  ...  NaN  0c2e182a0c  0bb492ef17

[3 rows x 11 columns]

In [ ]:
# to know more about the dataframe

cells.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3974 entries, 0 to 3973
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   VILLES        3974 non-null   object
 1   STATUS        3907 non-null   object
 2   LOCALISATION  3974 non-null   object
 3   DECOUPZONE    3974 non-null   object
 4   ZONENAME      3968 non-null   object
 5   LONGITUDE     3974 non-null   float64
 6   LATITUDE      3974 non-null   float64
 7   REGION        3974 non-null   object
 8   AREA          3951 non-null   object
 9   CELL_ID       3974 non-null   object
 10  SITE_CODE     3974 non-null   object
dtypes: float64(2), object(9)
memory usage: 341.6+ KB

In [ ]:
# Check for missing values
cells.isnull().sum().sort_values(ascending=False)

STATUS          67
AREA            23
ZONENAME         6
SITE_CODE        0
CELL_ID          0
REGION           0
LATITUDE         0
LONGITUDE        0
DECOUPZONE       0
LOCALISATION     0
VILLES           0
dtype: int64

In [ ]:
#Check for duplicates
cells.duplicated().value_counts()

False    3931
True       43
dtype: int64

In [ ]:

# Drop all duplicates
cells.drop_duplicates(inplace=True)
cells.head(3)

   VILLES      STATUS LOCALISATION  ... AREA     CELL_ID   SITE_CODE
0  ADJAME  In Service      ABIDJAN  ...  NaN  fbb2e75af3  0bb492ef17
1  ADJAME  In Service      ABIDJAN  ...  NaN  1502501d78  0bb492ef17
2  ADJAME  In Service      ABIDJAN  ...  NaN  0c2e182a0c  0bb492ef17

[3 rows x 11 columns]

# 1.4 Telcom_dataset.csv

In [ ]:
# we use read_csv to load our csv file Telcom_dataset

dataset= pd.read_csv ('Telcom_dataset.csv')
dataset.head(3)

  PRODUTC  VALUE               DATETIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi

[3 rows x 10 columns]

In [ ]:

#Check for missing values
dataset.isnull().sum().sort_values(ascending=False)

SITE_ID            716
CELL_ID              0
COUNTRY_B            0
COUNTRY_A            0
DW_B_NUMBER_INT      0
DW_A_NUMBER_INT      0
CELL_ON_SITE         0
DATETIME             0
VALUE                0
PRODUTC              0
dtype: int64

In [ ]:
#Check for duplicates

dataset.duplicated().value_counts()

False    4919
True       82
dtype: int64

In [ ]:

# drop duplicates

dataset.drop_duplicates(inplace=True)
dataset.head(3)

  PRODUTC  VALUE               DATETIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi

[3 rows x 10 columns]

In [ ]:
# to rename the column produtc to product

dataset.rename(columns={'PRODUTC': 'PRODUCT', 'DATETIME':'DATE_TIME'}, inplace=True)
dataset.head(3)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0  2012-05-06 23:04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0  2012-05-06 23:05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms     25  2012-05-06 23:05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi

[3 rows x 10 columns]

In [ ]:
dataset['Time'] = pd.to_datetime(dataset['DATE_TIME']).dt.time
del dataset['DATE_TIME']

dataset.head(3)

  PRODUCT  VALUE CELL_ON_SITE  ...     CELL_ID     SITE_ID      Time
0   Voice      0            1  ...  /TJNe+Mmtu  /TJNe+Mmtu  23:04:37
1     sms      0            0  ...  /+cKZKIp41  /+cKZKIp41  23:05:25
2     sms     25            0  ...  /u0FSD+ahi  /u0FSD+ahi  23:05:41

[3 rows x 10 columns]

In [ ]:
# to know more about the dataset

dataset.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4919 entries, 0 to 5000
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   PRODUCT          4919 non-null   object
 1   VALUE            4919 non-null   int64
 2   CELL_ON_SITE     4919 non-null   object
 3   DW_A_NUMBER_INT  4919 non-null   object
 4   DW_B_NUMBER_INT  4919 non-null   object
 5   COUNTRY_A        4919 non-null   object
 6   COUNTRY_B        4919 non-null   object
 7   CELL_ID          4919 non-null   object
 8   SITE_ID          4215 non-null   object
 9   Time             4919 non-null   object
dtypes: int64(1), object(9)
memory usage: 422.7+ KB

# 1.5 Telcom_dataset2

In [ ]:
# we use read_csv to load our csv file Telcom_dataset2

dataset2 = pd.read_csv ('Telcom_dataset2.csv')
dataset2.head(3)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0     sms      0  2012-05-07 23:02:06.0  ...     19e2e  +854AcBQT2  +854AcBQT2
1   Voice      0  2012-05-07 23:03:44.0  ...     19e2e  +854AcBQT2  +854AcBQT2
2     sms      0  2012-05-07 23:04:06.0  ...     19e2e  +laSrk7g6q  +laSrk7g6q

[3 rows x 10 columns]

In [ ]:
# check for missing values

dataset2.isnull().sum().sort_values(ascending=False)

SITE_ID         676
CELL_ID           0
COUNTRY_B         0
COUNTRY_A         0
DW_B_NUMBER       0
DW_A_NUMBER       0
CELL_ON_SITE      0
DATE_TIME         0
VALUE             0
PRODUCT           0
dtype: int64

In [ ]:
#Check for duplicates 

dataset2.duplicated().value_counts()

False    4923
True       78
dtype: int64

In [ ]:
# drop all duplicates
dataset2.drop_duplicates(inplace=True)
dataset2.head(3)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0     sms      0  2012-05-07 23:02:06.0  ...     19e2e  +854AcBQT2  +854AcBQT2
1   Voice      0  2012-05-07 23:03:44.0  ...     19e2e  +854AcBQT2  +854AcBQT2
2     sms      0  2012-05-07 23:04:06.0  ...     19e2e  +laSrk7g6q  +laSrk7g6q

[3 rows x 10 columns]

In [ ]:
dataset2.sort_values(by=['PRODUCT'], inplace=True)
dataset2.head(3)

# cells_sorted = cells.groupby(['VILLES']).count()
# cells_sorted

     PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
1150   Voice     91  2012-05-08 00:00:09.0  ...     19e2e  64138404ce  b7aa3c28bb
1297   Voice     86  2012-05-08 00:00:11.0  ...     19e2e  4a4160c38b  6bc58d8be0
3475   Voice     54  2012-05-08 00:01:11.0  ...     19e2e  6dd4700581  854b64b46a

[3 rows x 10 columns]

In [ ]:
dataset2['Time'] = pd.to_datetime(dataset2['DATE_TIME']).dt.time
del dataset2['DATE_TIME']

dataset2.head(3)

     PRODUCT  VALUE CELL_ON_SITE  ...     CELL_ID     SITE_ID      Time
1150   Voice     91            2  ...  64138404ce  b7aa3c28bb  00:00:09
1297   Voice     86            1  ...  4a4160c38b  6bc58d8be0  00:00:11
3475   Voice     54            1  ...  6dd4700581  854b64b46a  00:01:11

[3 rows x 10 columns]

In [ ]:
# to know more about the dataset

dataset2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4923 entries, 1150 to 0
Data columns (total 10 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   PRODUCT       4923 non-null   object
 1   VALUE         4923 non-null   int64
 2   CELL_ON_SITE  4923 non-null   object
 3   DW_A_NUMBER   4923 non-null   object
 4   DW_B_NUMBER   4923 non-null   object
 5   COUNTRY_A     4923 non-null   object
 6   COUNTRY_B     4923 non-null   object
 7   CELL_ID       4923 non-null   object
 8   SITE_ID       4263 non-null   object
 9   Time          4923 non-null   object
dtypes: int64(1), object(9)
memory usage: 423.1+ KB

# 1.6 Telcom_dataset3

In [ ]:
# we use read_csv to load our csv file Telcom_dataset3

dataset3 = pd.read_csv('Telcom_dataset3.csv')
dataset3.head(3)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B      CELLID     SIET_ID
0   Voice     61  2012-05-08 23:01:28.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
1     sms      0  2012-05-08 23:01:31.0  ...     19e2e  +Fs4mTvdKx  +Fs4mTvdKx
2   Voice     10  2012-05-08 23:02:59.0  ...     19e2e  +ZaaZozy/+  +ZaaZozy/+

[3 rows x 10 columns]

In [ ]:
# check for missing values
dataset3.isnull().sum().sort_values(ascending=False)

SIET_ID            605
CELLID               0
COUNTRY_B            0
COUNTRY_A            0
DW_B_NUMBER_INT      0
DW_A_NUMBER_INT      0
CELL_ON_SITE         0
DATE_TIME            0
VALUE                0
PRODUCT              0
dtype: int64

In [ ]:
#Check for duplicates

dataset3.duplicated().value_counts()

False    4908
True       93
dtype: int64

In [ ]:
# drop all duplicates

dataset3.drop_duplicates(inplace=True)

dataset3.head(3)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B      CELLID     SIET_ID
0   Voice     61  2012-05-08 23:01:28.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
1     sms      0  2012-05-08 23:01:31.0  ...     19e2e  +Fs4mTvdKx  +Fs4mTvdKx
2   Voice     10  2012-05-08 23:02:59.0  ...     19e2e  +ZaaZozy/+  +ZaaZozy/+

[3 rows x 10 columns]

In [ ]:
dataset3.rename(columns={'CELLID' : 'CELL_ID', 'SIET_ID' : 'SITE_ID'}, inplace=True)
dataset3.head(3)

  PRODUCT  VALUE              DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice     61  2012-05-08 23:01:28.0  ...     19e2e  +38u2u/rfx  +38u2u/rfx
1     sms      0  2012-05-08 23:01:31.0  ...     19e2e  +Fs4mTvdKx  +Fs4mTvdKx
2   Voice     10  2012-05-08 23:02:59.0  ...     19e2e  +ZaaZozy/+  +ZaaZozy/+

[3 rows x 10 columns]

In [ ]:
dataset3['Time'] = pd.to_datetime(dataset3['DATE_TIME']).dt.time
del dataset3['DATE_TIME']

dataset3.head(3)

  PRODUCT  VALUE CELL_ON_SITE  ...     CELL_ID     SITE_ID      Time
0   Voice     61            2  ...  +38u2u/rfx  +38u2u/rfx  23:01:28
1     sms      0            1  ...  +Fs4mTvdKx  +Fs4mTvdKx  23:01:31
2   Voice     10            1  ...  +ZaaZozy/+  +ZaaZozy/+  23:02:59

[3 rows x 10 columns]

In [ ]:
# to know more about the dataset

dataset3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4908 entries, 0 to 5000
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   PRODUCT          4908 non-null   object
 1   VALUE            4908 non-null   int64
 2   CELL_ON_SITE     4908 non-null   object
 3   DW_A_NUMBER_INT  4908 non-null   object
 4   DW_B_NUMBER_INT  4908 non-null   object
 5   COUNTRY_A        4908 non-null   object
 6   COUNTRY_B        4908 non-null   object
 7   CELL_ID          4908 non-null   object
 8   SITE_ID          4311 non-null   object
 9   Time             4908 non-null   object
dtypes: int64(1), object(9)
memory usage: 421.8+ KB

# 1.7 cells_geo_description

In [ ]:
geo = pd.read_excel('cells_geo_description.xlsx')
geo.head()
geo

     Column name                                        Description  Format
0         VILLES                                               City  String
1         STATUS                                  In Service or not  String
2   LOCALISATION                                  in ABIDJAN or not  String
3     DECOUPZONE                                  Geographical Zone  String
4       ZONENAME                                       Name of Zone  String
5      LONGITUDE                                          Longitude   Float
6       LATITUDE                                           Latitude   Float
7         REGION                                             Region  String
8           AREA                                               Area  String
9        CELL_ID                                     ID of the cell  String
10     SITE_CODE  Site (there are several cells per site, severa...  String

# 1.8 CDR_description

In [ ]:
CDR = pd.read_excel('CDR_description.xlsx')
CDR.head()
CDR

       Column name                                        Description   Format
0          PRODUCT                                       Voice or SMS   String
1            VALUE                                      Billing price  Integer
2        DATE_TIME               Time in format yyyy-MM-dd hh:mm:ss.0   String
3     CELL_ON_SITE  Which cell in the site was used (not needed here)  Integer
4  DW_A_NUMBER_INT  Anonymized phone number of the person for whic...   String
5  DW_B_NUMBER_INT        Anonymized phone number of the counterparty   String
6        COUNTRY_A                  Country of party A (useless here)   String
7        COUNTRY_B                  Country of party B (useless here)   String
8          CELL_ID                                     ID of the cell   String
9          SITE_ID                                     ID of the SITE   String

# 1.9 Joining of dataframes

In [ ]:
# Join dataset, dataset2, dataset3 dataframes
dataset_all = pd.concat([dataset,dataset2,dataset3], axis=0, join='outer',ignore_index=True)
dataset_all

      PRODUCT  VALUE CELL_ON_SITE  ...      Time DW_A_NUMBER DW_B_NUMBER
0       Voice      0            1  ...  23:04:37         NaN         NaN
1         sms      0            0  ...  23:05:25         NaN         NaN
2         sms     25            0  ...  23:05:41         NaN         NaN
3       Voice     56            1  ...  23:05:42         NaN         NaN
4       Voice     14            1  ...  23:06:29         NaN         NaN
...       ...    ...          ...  ...       ...         ...         ...
14745   Voice     10            0  ...  00:01:43         NaN         NaN
14746   Voice      0            3  ...  00:01:43         NaN         NaN
14747   Voice     62            1  ...  00:01:43         NaN         NaN
14748   Voice     30            2  ...  00:01:43         NaN         NaN
14749   Voice     60            2  ...  00:01:43         NaN         NaN

[14750 rows x 12 columns]

In [ ]:
# merge dataset_all and cells

merged_df = pd.merge(dataset_all, cells, how='inner', left_on=['SITE_ID'], right_on=['SITE_CODE'])

merged_df

      PRODUCT  VALUE CELL_ON_SITE  ...           AREA   CELL_ID_y   SITE_CODE
0         sms      0            1  ...   CENTRE NORTH  24ccdda3d5  1b5540c02d
1         sms      0            1  ...   CENTRE NORTH  ebfc58af70  1b5540c02d
2         sms      0            1  ...   CENTRE NORTH  ba8ce6e4ef  1b5540c02d
3         sms      0            1  ...   CENTRE NORTH  c2545171dc  1b5540c02d
4         sms      0            1  ...   CENTRE NORTH  f15bd5483f  1b5540c02d
...       ...    ...          ...  ...            ...         ...         ...
49697   Voice     17            4  ...  ABIDJAN NORTH  c179f33d5e  cc45940406
49698   Voice     17            4  ...  ABIDJAN NORTH  0a3f751619  cc45940406
49699     sms      0            2  ...   CENTRE NORTH  0427a26d34  ab91f5b21d
49700     sms      0            2  ...   CENTRE NORTH  7c72293cf2  ab91f5b21d
49701     sms      0            2  ...   CENTRE NORTH  be18b5b981  ab91f5b21d

[49702 rows x 23 columns]

# 1.9 Dataframe analysis

In [ ]:
# Find regions with the highest value counts
merged_df['REGION'].value_counts()

LAGUNE               32547
LACS                  2408
BAS SASSANDRA         2327
HAUT SASSANDRA        2277
VALLEE DU BANDAMA     1551
SUD BANDAMA           1518
SAVANE                 980
FROMAGER               904
WORODOUGOU             792
18 MONTAGNES           765
MARAHOUE               618
AGNEBY                 581
NZI COMOE              564
MOYEN CAVALLY          528
DENGUELE               395
ZANZAN                 330
MOYEN COMOE            315
SUD COMOE              203
BAFING                  99
Name: REGION, dtype: int64

In [ ]:
# Find zones with the highest value counts
merged_df['ZONENAME'].value_counts()

ZONE C - Abidjan_OUEST     10296
ZONE E - Abidjan_NORD       6660
ZONE B - Grand-SUD          5545
ZONE B - Abidjan_EST        4838
ZONE D - Abidjan_SUD        4642
ZONE D - Grand-OUEST        4314
ZONE A - Abidjan_CENTRE     4132
ZONE A - Grand-NORD         3928
ZONE E - SUD-OUEST          2993
ZONE C - Grand-EST          1748
ZONE D - Abidjan_EST         186
OKAHOTEL                     120
NPONON                        72
WILLIAMSVILLE2                40
ZONE C - Abidjan_EST          27
PALMABINGERVILLE              21
ZONE A - Abidjan_OUEST        21
ZONE B - Grand-EST            18
ZONE A - Grand-SUD            18
ZONE B - Abidjan_OUEST        18
ZONE C - Abidjan_SUD          15
ZONE A - Grand-EST             6
ZONE D - Grand-SUD             6
ZONE B - Abidjan_SUD           6
ZONE B - Abidjan-EST           3
ZONE B - Grand-NORD            3
AGBANNEW                       3
ZONE B - Abidjan_Nord          3
ZONE B - Abidjan_CENTRE        2
Name: ZONENAME, dtype: int64

In [ ]:
# find high traffic zones

high_traffic_zones = ['ZONE C - Abidjan_OUEST','ZONE E - Abidjan_NORD','ZONE B - Grand-SUD','ZONE B - Abidjan_EST',
                      'ZONE D - Abidjan_SUD','ZONE D - Grand-OUEST','ZONE A - Abidjan_CENTRE','ZONE A - Grand-NORD',
                      'ZONE E - SUD-OUEST','ZONE C - Grand-EST']

zones_df = merged_df[merged_df['ZONENAME'].isin(high_traffic_zones)]
zones_df.head(3)

  PRODUCT  VALUE CELL_ON_SITE  ...          AREA   CELL_ID_y   SITE_CODE
0     sms      0            1  ...  CENTRE NORTH  24ccdda3d5  1b5540c02d
1     sms      0            1  ...  CENTRE NORTH  ebfc58af70  1b5540c02d
2     sms      0            1  ...  CENTRE NORTH  ba8ce6e4ef  1b5540c02d

[3 rows x 23 columns]

In [ ]:
# Determine cities in high traffic zones with traffic > 1000
cities = zones_df['VILLES'].value_counts()
high_traffic_cities = cities[cities > 1000]
high_traffic_cities

YOPOUGON        8432
ABOBO           5967
COCODY          3698
ADJAME          2442
KOUMASSI        2275
YAMOUSSOUKRO    2076
TREICHVILLE     2026
MARCORY         1901
DALOA           1747
ATTECOUBE       1607
PORT-BOUET      1423
SAN-PEDRO       1291
BOUAKE          1242
Name: VILLES, dtype: int64

In [ ]:
# high traffic regions

high_traffic_regions = ['LAGUNE','LACS','BAS SASSANDRA','HAUT SASSANDRA','VALLEE DU BANDAMA','SUD BANDAMA']

region_df = merged_df[merged_df['REGION'].isin(high_traffic_regions)]
region_df.head(3)

  PRODUCT  VALUE CELL_ON_SITE  ...          AREA   CELL_ID_y   SITE_CODE
0     sms      0            1  ...  CENTRE NORTH  24ccdda3d5  1b5540c02d
1     sms      0            1  ...  CENTRE NORTH  ebfc58af70  1b5540c02d
2     sms      0            1  ...  CENTRE NORTH  ba8ce6e4ef  1b5540c02d

[3 rows x 23 columns]

In [ ]:
# determine cities within regions
cities_regions = region_df['VILLES'].value_counts()

#Determine cities with traffic greater than 1000 based on region grouping
high_cities_regions = cities_regions[cities_regions > 1000]

# Then we find cities that occur in both 
high_impact_cities = high_cities_regions | high_cities_regions
high_impact_cities

YOPOUGON        8432
ABOBO           6159
COCODY          3704
ADJAME          2505
KOUMASSI        2275
MARCORY         2087
YAMOUSSOUKRO    2076
TREICHVILLE     2026
DALOA           1747
ATTECOUBE       1634
PORT-BOUET      1423
SAN-PEDRO       1291
BOUAKE          1242
Name: VILLES, dtype: int64

In [ ]:
cities_df = merged_df[merged_df['VILLES'].isin(high_impact_cities.index)]

cities_df.head(3)

  PRODUCT  VALUE CELL_ON_SITE  ...          AREA   CELL_ID_y   SITE_CODE
0     sms      0            1  ...  CENTRE NORTH  24ccdda3d5  1b5540c02d
1     sms      0            1  ...  CENTRE NORTH  ebfc58af70  1b5540c02d
2     sms      0            1  ...  CENTRE NORTH  ba8ce6e4ef  1b5540c02d

[3 rows x 23 columns]

In [ ]:
# determine product usage in high traffic cities

services = cities_df['PRODUCT'].value_counts(normalize=True)
services

sms      0.613317
Voice    0.386683
Name: PRODUCT, dtype: float64

In [ ]:
# Determine busiest hours of the day

# Import datetime 
import datetime as dt